Can't project Analytical Model. Planes do not intersect each other.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId ProjectionPlanesNotIntersect { get; }
  Visual Basic
Public Shared ReadOnly Property ProjectionPlanesNotIntersect As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ ProjectionPlanesNotIntersect {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures AnalyticalModelFailures Class
  Autodesk.Revit.DB Namespace